Aghosh993/Trinity2013/STM32F3x/src/main.cpp
	GPIO_WriteBit(GPIOE, GPIO_Pin_2, Bit_RESET);
	GPIO_WriteBit(GPIOE, GPIO_Pin_3, Bit_RESET);

	/*
	 * 	a.GPIO_Mode = GPIO_Mode_OUT;
	a.GPIO_PuPd = GPIO_PuPd_NOPULL;
	a.GPIO_OType = GPIO_OType_PP;
	a.GPIO_Speed = GPIO_Speed_Level_2;

	 */
}
/*
 * PB0: OUTPUT
 * PC1: INPUT
 */
void ping_pin_init(void)
{

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOF, ENABLE);

	GPIO_InitTypeDef g;
	g.GPIO_Mode = GPIO_Mode_IN;
	g.GPIO_OType = GPIO_OType_OD;
	g.GPIO_Pin = GPIO_Pin_9;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Speed = GPIO_Speed_Level_1;

	GPIO_Init(GPIOF, &g);

	g.GPIO_Mode = GPIO_Mode_OUT;
	g.GPIO_OType = GPIO_OType_PP;
	g.GPIO_Pin = GPIO_Pin_0;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Speed = GPIO_Speed_Level_1;

	GPIO_Init(GPIOB, &g);

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOF, EXTI_PinSource9);

}

void timer2_timebase_init(void)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	TIM_TimeBaseStructure.TIM_Period = 17999;//1899;//0xFFFFFFFF;//1899;//0xFFFFFFFF;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseStructure.TIM_Prescaler = 71;//0;//71;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
//	TIM_Cmd(TIM2, ENABLE);

	TIM_SetCounter(TIM2, 0);
}

/*
 * Use COMP2, COMP3, COMP4, COMP7
 * COMP2: 	Input->		PA7  (IO1)
 * 			Output->	PB9
 * COMP3:	Input->		PB14 (IO1)
 * 			Output->	PA8
 * COMP4:	Input->		PE7  (IO2)
 * 			Output->	PB1
 * COMP7:	Input->		PC1	 (IO2)
 * 			Output->	PC2
 */

void comp_init(void)
{
	//COMP2 Init:

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	GPIO_InitTypeDef g;

	g.GPIO_Mode = GPIO_Mode_AN;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Pin = GPIO_Pin_7;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);
	GPIO_Init(GPIOA, &g);

	g.GPIO_Mode = GPIO_Mode_AF;
	g.GPIO_OType = GPIO_OType_PP;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Pin = GPIO_Pin_9;

	GPIO_PinAFConfig(GPIOB, GPIO_PinSource9, GPIO_AF_8);
	GPIO_Init(GPIOB, &g);

	RCC_PCLK2Config(RCC_HCLK_Div1);

	COMP_InitTypeDef c;

	c.COMP_InvertingInput = COMP_InvertingInput_VREFINT;
	c.COMP_NonInvertingInput = COMP_NonInvertingInput_IO1;
	c.COMP_Mode = COMP_Mode_MediumSpeed;
	c.COMP_Output = COMP_Output_None;
	c.COMP_OutputPol = COMP_OutputPol_NonInverted;
	c.COMP_Hysteresis = COMP_Hysteresis_Low;
	c.COMP_BlankingSrce = COMP_BlankingSrce_None;

	COMP_Init(COMP_Selection_COMP2, &c);
	COMP_Cmd(COMP_Selection_COMP2, ENABLE);

	//COMP3 Init:

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	g.GPIO_Mode = GPIO_Mode_AN;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Pin = GPIO_Pin_14; 	//PB14 = INPUT

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOA, ENABLE);
	GPIO_Init(GPIOB, &g);

	g.GPIO_Mode = GPIO_Mode_AF;
	g.GPIO_OType = GPIO_OType_PP;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Pin = GPIO_Pin_8; 	//PA8 = OUTPUT

	GPIO_PinAFConfig(GPIOC, GPIO_PinSource8, GPIO_AF_7);
	GPIO_Init(GPIOC, &g);

	RCC_PCLK2Config(RCC_HCLK_Div1);

	c.COMP_InvertingInput = COMP_InvertingInput_VREFINT;
	c.COMP_NonInvertingInput = COMP_NonInvertingInput_IO1;
	c.COMP_Mode = COMP_Mode_MediumSpeed;
	c.COMP_Output = COMP_Output_None;
	c.COMP_OutputPol = COMP_OutputPol_NonInverted;
	c.COMP_Hysteresis = COMP_Hysteresis_Low;
	c.COMP_BlankingSrce = COMP_BlankingSrce_None;

	COMP_Init(COMP_Selection_COMP3, &c);
	COMP_Cmd(COMP_Selection_COMP3, ENABLE);

	//COMP4 Init:

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	g.GPIO_Mode = GPIO_Mode_AN;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Pin = GPIO_Pin_7; 	//PE7 = INPUT

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOE | RCC_AHBPeriph_GPIOB, ENABLE);
	GPIO_Init(GPIOE, &g);

	g.GPIO_Mode = GPIO_Mode_AF;
	g.GPIO_OType = GPIO_OType_PP;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Pin = GPIO_Pin_1; 	//PB1 = OUTPUT

	GPIO_PinAFConfig(GPIOB, GPIO_PinSource1, GPIO_AF_8);
	GPIO_Init(GPIOB, &g);

	RCC_PCLK2Config(RCC_HCLK_Div1);

	c.COMP_InvertingInput = COMP_InvertingInput_VREFINT;
	c.COMP_NonInvertingInput = COMP_NonInvertingInput_IO2;
	c.COMP_Mode = COMP_Mode_MediumSpeed;
	c.COMP_Output = COMP_Output_None;
	c.COMP_OutputPol = COMP_OutputPol_NonInverted;
	c.COMP_Hysteresis = COMP_Hysteresis_Low;
	c.COMP_BlankingSrce = COMP_BlankingSrce_None;

	COMP_Init(COMP_Selection_COMP4, &c);
	COMP_Cmd(COMP_Selection_COMP4, ENABLE);

	//COMP7 Init:

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	g.GPIO_Mode = GPIO_Mode_AN;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Pin = GPIO_Pin_1; 	//PC1 = INPUT

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);
	GPIO_Init(GPIOC, &g);

	g.GPIO_Mode = GPIO_Mode_AF;
	g.GPIO_OType = GPIO_OType_PP;
	g.GPIO_PuPd = GPIO_PuPd_NOPULL;
	g.GPIO_Pin = GPIO_Pin_2; 	//PC2 = OUTPUT

	GPIO_PinAFConfig(GPIOC, GPIO_PinSource2, GPIO_AF_3);////////!!!!!!!!!!
	GPIO_Init(GPIOC, &g);

	RCC_PCLK2Config(RCC_HCLK_Div1);

	c.COMP_InvertingInput = COMP_InvertingInput_VREFINT;
	c.COMP_NonInvertingInput = COMP_NonInvertingInput_IO2;
	c.COMP_Mode = COMP_Mode_MediumSpeed;
	c.COMP_Output = COMP_Output_None;
	c.COMP_OutputPol = COMP_OutputPol_NonInverted;
	c.COMP_Hysteresis = COMP_Hysteresis_Low;
	c.COMP_BlankingSrce = COMP_BlankingSrce_None;

	COMP_Init(COMP_Selection_COMP7, &c);
	COMP_Cmd(COMP_Selection_COMP7, ENABLE);
}

int16_t calc_gyro_bias(void)
{
	int i = 0;
	int accum_x = 0;

	union twosComp {		// Takes care of two's complement conversion
		uint16_t un_signed;
		int16_t output;
	} convert;

	uint8_t bytes[2];

	for(i = 0; i < 250; ++i)
	{
		L3GD20_Read(bytes, L3GD20_OUT_X_L_ADDR, 2);
		convert.un_signed = (bytes[1] << 8) | bytes[0];
		accum_x += convert.output;
	}
	return (int16_t)((float)accum_x/(float)250);
}

/*
 * Initializes the DMA controller to transfer data between the ADC (ADC1) and
 * a user-supplied location in memory
 * @Args: None
 * @Return Val: None
 */

void adc1_init_DMA(void)
{
	// Init structures required to initialize the peripherals as required:

	ADC_InitTypeDef       ADC_InitStructure;
	ADC_CommonInitTypeDef ADC_CommonInitStructure;
	GPIO_InitTypeDef      GPIO_InitStructure;

	/* Configure the ADC clock */
	RCC_ADCCLKConfig(RCC_ADC12PLLCLK_Div2);
	/* Enable ADC1 clock */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_ADC12, ENABLE);
	/* GPIOC Periph clock enable */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

